tests/stress/config.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 1
      name: Warm up
    - duration: 120
      arrivalRate: 1
      rampTo: 10
      name: Ramp up to 10
    - duration: 240
      arrivalRate: 10
      name: Sustained load
scenarios:
  - name: Get Product
    flow:
      - get:
          url: "/products/1000000"