tests/stress/config.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 1
      name: Sustained 1

    - duration: 30
      arrivalRate: 1
      rampTo: 10
      name: Ramp up to 10

    - duration: 30
      arrivalRate: 10
      name: Sustained 10

    # - duration: 30
    #   arrivalRate: 10
    #   rampTo: 100
    #   name: Ramp up to 100

    # - duration: 30
    #   arrivalRate: 100
    #   name: Sustained 100

    # - duration: 30
    #   arrivalRate: 100
    #   rampTo: 1000
    #   name: Ramp up to 1000

    # - duration: 30
    #   arrivalRate: 1000
    #   name: Sustained 1000

scenarios:
  - name: Get Product
    flow:
      - get:
          url: "/products/1000000"
  # - name: Get Styles
  #   flow:
  #     - get:
  #         url: "/products/1000000/styles"
  # - name: Get Cart
  #   flow:
  #       - get:
  #           url: "/cart"